#pragma once
#if !defined ___TECHTRAINING_CHAPTER2_LIST_MANUAL_TEST___
#define      ___TECHTRAINING_CHAPTER2_LIST_MANUAL_TEST___

//--------------------------------------------------------------------------------
// ファイル依存関係
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
// マクロ定義
//--------------------------------------------------------------------------------
// コンパイル関連手動テスト(リスト)

// ※コンパイルが通らなければ成功
//#define TT_TEST_NULL_KEY



#endif // ___TECHTRAINING_CHAPTER2_LIST_MANUAL_TEST___

